#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/fer1035/aws01/runs/run-FUPYDAya6vsgBq51

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.security_demo.aws_api_gateway_api_key.api_key: Refreshing state... [id=ihj63dfy4l]
module.security_demo.aws_api_gateway_rest_api.api: Refreshing state... [id=qnvmgu9rlh]
module.security_demo.aws_iam_role.iam_for_lambda: Refreshing state... [id=tf_lambda_role]
module.tennis.aws_s3_bucket.bucket1: Refreshing state... [id=pp-bucket1-us-east-1-531133914787]
module.tennis.aws_s3_bucket.bucket2: Refreshing state... [id=pp-bucket2-us-east-1-531133914787]
module.security_demo.aws_api_gateway_request_validator.validator: Refreshing state... [id=xct5vd]
module.security_demo.aws_api_gateway_resource.resource: Refreshing state... [id=al7w62]
module.security_demo.aws_api_gateway_model.model: Refreshing state... [id=eio5d0]
module.security_demo.aws_lambda_function.function: Refreshing state... [id=tf_lambda]
module.security_demo.aws_api_gateway_method.method: Refreshing state... [id=agm-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_method_response.response_200: Refreshing state... [id=agmr-qnvmgu9rlh-al7w62-POST-200]
module.security_demo.aws_wafv2_web_acl.waf_regional: Refreshing state... [id=155e333c-d687-4682-9d74-f62807218e7d]
module.security_demo.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.security_demo.aws_api_gateway_integration.integration: Refreshing state... [id=agi-qnvmgu9rlh-al7w62-POST]
module.security_demo.aws_api_gateway_deployment.deployment: Refreshing state... [id=1lsitd]
module.security_demo.aws_api_gateway_stage.stage: Refreshing state... [id=ags-qnvmgu9rlh-test]
module.tennis.aws_cloudwatch_event_rule.rule: Refreshing state... [id=pp-rule-us-east-1-531133914787]
module.tennis.aws_iam_role.role: Refreshing state... [id=pp-role-us-east-1-531133914787]
module.security_demo.aws_api_gateway_usage_plan.usage_plan: Refreshing state... [id=35dwin]
module.security_demo.aws_api_gateway_method_settings.all: Refreshing state... [id=qnvmgu9rlh-test-*/*]
module.security_demo.aws_api_gateway_usage_plan_key.plan_key: Refreshing state... [id=ihj63dfy4l]
module.tennis.aws_lambda_function.function: Refreshing state... [id=pp-lambda-us-east-1-531133914787]
module.tennis.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromEventBridge]
module.tennis.aws_cloudwatch_event_target.lambda: Refreshing state... [id=pp-rule-us-east-1-531133914787-pp-lambda-us-east-1-531133914787]
module.security_demo.aws_wafv2_web_acl_association.waf_association: Refreshing state... [id=arn:aws:wafv2:us-east-1:531133914787:regional/webacl/StandardACL_Regional/155e333c-d687-4682-9d74-f62807218e7d,arn:aws:apigateway:us-east-1::/restapis/qnvmgu9rlh/stages/test]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.security_demo.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "tf_lambda"
      ~ last_modified                  = "2021-11-03T13:46:31.204+0000" -> (known after apply)
      ~ source_code_hash               = "4eD2I7NLO7rKrZDlAnZn6CqCp9pruXH1Cb37ZGdBJpg=" -> "5fdbr7HKBncLozY2XOvroqegiZ1XT4xj+cSp80ZZC0w="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.tennis.aws_cloudtrail.trail will be created
  + resource "aws_cloudtrail" "trail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = false
      + is_multi_region_trail         = false
      + is_organization_trail         = false
      + name                          = "pp-cloudtrail-us-east-1-531133914787"
      + s3_bucket_name                = "pp-buckettrail-us-east-1-531133914787"
      + tags_all                      = (known after apply)

      + event_selector {
          + include_management_events = false
          + read_write_type           = "WriteOnly"

          + data_resource {
              + type   = "AWS::S3::Object"
              + values = [
                  + "arn:aws:s3:::pp-bucket1-us-east-1-531133914787/",
                  + "arn:aws:s3:::pp-bucket2-us-east-1-531133914787/",
                ]
            }
        }
    }

  # module.tennis.aws_lambda_function.function will be updated in-place
  ~ resource "aws_lambda_function" "function" {
        id                             = "pp-lambda-us-east-1-531133914787"
      ~ last_modified                  = "2021-11-03T13:46:25.679+0000" -> (known after apply)
      ~ source_code_hash               = "XV5RkSWQN5pXtMtPJL5bgEHQegr0wQ0jnh57t/Tk690=" -> "etRqMH+oN+IZutMXpd6QWMF8ZTPgnmWbkDk8YVP4Hdo="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.tennis.aws_s3_bucket.bucket_trail will be created
  + resource "aws_s3_bucket" "bucket_trail" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "pp-buckettrail-us-east-1-531133914787"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::pp-buckettrail-us-east-1-531133914787"
                      + Sid       = "AWSCloudTrailAclCheck"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::pp-buckettrail-us-east-1-531133914787/*",
                        ]
                      + Sid       = "AWSCloudTrailWrite"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.


```

</details>

*Pusher: @fer1035, Action: `pull_request`*